import React from 'react';
import { getImagePath } from '../../utilities';
import styles from './services.module.css';

export default function ServicesPage() {
  return (
    <div className={styles.services}>
      <div>
        <h1>Сон у вулику</h1>
        <span>
          Вічно можна дивитись на три речі: як горить вогонь, як тече вода і як
          працюють інші. А слухати, як працюють бджоли одне задоволення, до того
          ж корисне.
        </span>
        <img src={getImagePath('service1.jpg')} alt=""></img>
        <p>Вартість 1 години такого задоволення 40 грн.</p>
        <p>
          Ніч у вулику - 250 грн. Для УБД весь сезон 2023 року - безкоштовно.
        </p>
        <img src={getImagePath('service2.jpg')} alt=""></img>
        <p>
          Апітерапевти рекомендують проводити сеанси не менше 3 годин за один
          раз, всього 5-10 сеансів для отримання ефекту.{' '}
        </p>
      </div>
      <div>
        <h1>Екскурсія на пасіку</h1>
        <p>
          Не зважаючи на пору року, Ви можете завжди відвідати апітерапевтичний
          комплекс МИВІРА. Організовуються екскурсії як для дорослих , так і для
          школярів.
        </p>
        <img src={getImagePath('service3.jpg')} alt=""></img>
        <p>
          Кожному відвідувачу видається захисна шапка бджоляра. Під час
          екскурсії Ви дізнаєтеся чим живуть бджоли, з чого складається бджолина
          сім&apos;я, історію розвитку бджільництва, про користь меду і його
          лікувальні властивості. Відвідаєте музей бджільництва, єдиний на
          Буковині. Та побачите життя бджіл під склом у прозорому вулику.
          <br />
          Екскурсія включає в себе дегустацію меду різних видів з ароматним чаєм
          та печивом.
        </p>
        <p>Для повнолітніх відвідувачів пропонуємо ще іншу дегустацію.</p>
        <img src={getImagePath("service4.jpg")} alt=""></img>
        <p>Вартість ексурсії 70 грн для дорослих, 60 грн для дітей. </p>
      </div>
      <blockquote>
        Одночасно на бджолах можуть відпочивати до 10 осіб. Оздоровчий комплекс включає в себе 1 пятимісний апібудиночок, 2 одномісних апібудиночки і 3 одномісних лежанки-піраміди. Вибирайте собі, що Вам до вподоби!
      </blockquote>
    </div>
  );
}
