import {getImagePath} from "../../utilities";

export type Product = {
    id: number,
    title: string,
    image: string,
    description: string,
    types: Array<string>,
    volumes: Array<string>
};

export function getProducts(): Array<Product> {
    return [
        {
            id: 0,
            title: "Мед",
            image: getImagePath("product0.jpg"),
            description: "",
            types: ["Травневий", "Різноквітковий", "Липовий", "Лісовий"],
            volumes: ["0,5л", "1л"]
        },
        {
            id: 1,
            title: "Забрус",
            image: getImagePath("product1.jpg"),
            description: "Забрус - це воскові кришечки, якими бджоли запечатують мед у сотах. Саме їх потрібно зрізати перед відкачуванням меду. В своєму складі він містить віск, прополіс, квітковий пилок, мед і секрет слинних залоз бджіл,(сезонно)",
            types: [],
            volumes: []
        },
        {
            id: 2,
            title: "Бджолиний пилок",
            image: getImagePath("product2.jpg"),
            description: "Своїм корисним властивостям пилок бджолиний завдячує унікальному складу, який включає: нуклеїнові кислоти амінокислоти фосфоліпіди стероїди фенольні сполуки вітаміни макро- і мікроелементи натуральні антибіотики Головний \"козир\" бджолиного пилку - вітаміни в складі. У продуктові наявні каротиноїди, вітаміни групи В, С, D, Е, Р, РР, К. Не меншу роль відіграє присутність майже трьох десятків мінералів: калію, кальцію, магнію, йоду, заліза, фосфору, цинку та інших.",
            types: [],
            volumes: []
        },
        {
            id: 3,
            title: "Настоянка прополісу",
            image: getImagePath("product3.jpg"),
            description: "Цілющі властивості прополіс відомі всім: це і допомога при болі в горлі, і вирішення проблем шлунку, і підтримка щитовидної залози і багато іншого.",
            types: [],
            volumes: ["100мл"]
        },
        {
            id: 4,
            title: "Фруктово горіхове асорті в меді",
            image: getImagePath("product4.jpg"),
            description: "Кожна баночка як дівчина - яскрава, солодка, індивідуальна і дуже красива. Взявши до рук, хочеться милуватися кожною дрібничкою всередині. А під кришечкою : і горішки, і сухофрукти, і цукати та з травневим медом - то ідеальне поєднання.",
            types: [],
            volumes: ["200 мл", "314мл", "550мл"]
        },
        {
            id: 5,
            title: "Паста Амосова",
            image: getImagePath("product5.jpg"),
            description: "Супервітамінна суміш для підтримання імунітету. У своєму складі паста має все , що потрібно для відновлення організму після важкої праці чи хвороби. А саме: мед, інжир, чорнослив, курага, родзинки, лимон.",
            types: [],
            volumes: ["200 мл", "314мл", "550мл"]
        },
        {
            id: 6,
            title: "Горіхи з медом Еліт",
            image: getImagePath("product6.jpg"),
            description: "Неймовірна смакота, яка викликає залежність. Гармонійне поєднання травневого меду з горішками еліт просто вражає. Фундук, мигдаль та кеш'ю один за одним скачуть до ложечки, а далі зупинитись дуже важко… ",
            types: [],
            volumes: ["200 мл", "314мл", "550мл"]
        },
        {
            id: 7,
            title: "Крем мед",
            image: getImagePath("product7.jpg"),
            description: "Натуральний бджолиний мед, збитий прогтягом дуже довгого часу.\n" +
                "Він має надзвичайно ніжну кремові текстуру та всю користь різноквіткового меду. В асортименті смаки:  класичний, кориця, журавлина, кокос мигдаль, шоколад, мандарин.",
            types: [],
            volumes: ["100 мл", "200мл"]
        },
        {
            id: 8,
            title: "Мазь для суглобів",
            image: getImagePath("product8.jpg"),
            description: "Суперефективний засіб від болю в суглобах на основі живокосту Допомагає мазь зняти запальні процеси при болях у спині та суглобах, використовується під час відновлення після переломів При виготовленні мазі використовуються найкращі натуральні складники: корінь живокосту; сабельник; живиця; корінь лопуха; трава вересу; трава звіробою",
            types: [],
            volumes: []
        },
        {
            id: 9,
            title: "Карпатський чай",
            image: getImagePath("product9.jpg"),
            description: "Різноманіття трав, зібраних з високогір\"я Карпат, висушених у найкращих умовах зібралися в одному місці для створення запашного чаю, який повертає у дитинство",
            types: [],
            volumes: []
        },
        {
            id: 10,
            title: "Медові напої",
            image: "",
            description: "Різноманітність смаків медових настоянок не залишить байдужим жодного поціновувача. Серед 11 смаків зігріваючих напоїв , Ви точно знайдете свій улюблений",
            types: [],
            volumes: []
        },
        {
            id: 11,
            title: "Березовий сік",
            image: "",
            description: "Вся користь природи зібралась у цій банці з мінімумом доданого цукру. Екологічно чистий сік, зібраний з беріз, що ростуть навколо пасіки.",
            types: [],
            volumes: ["2л", "3л"]
        }
    ]
}