import React from "react";
import styles from "./about.module.css"
import {getImagePath} from "../../utilities";

export default function AboutUsPage() {
    return <div>
        <p>
            Михайлівський апітерапевтичний оздоровчий комплекс МИВІРА відкрито 6 травня 2018 року в рамках програми
            сталого розвитку Чернівецької області за підтримки Австрійської Агенції Розвитку, програми розвитку ООН в
            Україні та фізичної-особи підприємця Баловсяк Михайла.
        </p>
        <img className={styles.leftFloat} src={getImagePath("about1.jpg")} alt=""></img>
        <h1>
            Що ж представляє із себе оздоровчий комплекс «МИВІРА»?
        </h1>
        <p>Це 1 п"ятимісний будиночок, 2 одномісні будинки та 3 піраміди із 10 лежанками, куди люди зможуть прийти,
            полежати декілька годин, або переночувати. Під лежаками живуть 40 сімей бджіл, які і виступають у ролі
            лікарів.
            Тут немає ні граму хімії. Все зроблено з натуральних матеріалів, всі фарби — на водяній основі.</p>
        <p>
            Будиночки оздоблені іконами та іншими цікавими речами. А також цікавий музей бджільництва в якому є і
            старовинні і сучасні експонати.
        </p>
        <p className={styles.clearFloat}>
            Відпочивати на цих лежанках, потрібно не менше двох годин, а восьми годин вистачає сповна. Можна це робити
            тільки з 1 квітня до кінця жовтня, коли у бджіл йде розвиток.
        </p>
        <img className={styles.rightFloat} src={getImagePath("about2.jpg")} alt=""></img>
        <blockquote>
            — Це загальне оздоровлення організму. Тут поспав три години, і так ніби спав цілу ніч. Прокидаєшся іншою людиною.
        </blockquote>
        <p>
            Бджолині вібрації позитивно впливають на всі процеси в організмі, а саме на дихальну систему, опорно-руховий апарат, нервову і психічну системи. Апітерапія корисна діабетикам та не має протипоказань. Навіть алергіки можуть скористатись послугою сну на вулику, так як немає прямого контакту ні з медом, ні з бджолами, ні з продуктами їх життєдіяльності.
        </p>
        <p>
            Ласкаво просимо в гості, відчуйте цілющу силу бджіл на собі!
        </p>
    </div>
}