import React from "react";

export default function ContactUs() {
    return <footer>
        <h1>Михайлівський апітерапевтичний оздоровчий центр запрошує Вас</h1>
        <hr />
        <address>
        Наша адреса: <strong>Чернівецька обл., Глибоцький р-н, с Михайлівка, вул Шевченка 6.</strong>
        <br />
        Контактні дані:
            <ul>
                <li>
                    <a href="tel:+380957874423">+380957874423</a>,&nbsp;
                    <a href="tel:+380987409747">+380987409747</a> &nbsp;
                    Галина
                </li>
                <li>
                    <a href="tel:+380977348930">+380987409747</a> Віра
                </li>
            </ul>
            <p className="share-text">
                Ми в соціальних мережах:
                <a href="https://www.facebook.com/apiterapiiamivira" title="Апітерапія в фейсбуці">
                    <span className="share-icon">
                        <svg width="100%" viewBox="0 0 24 24">

        <path
            d="M12,2C6.477,2,2,6.477,2,12c0,5.013,3.693,9.153,8.505,9.876V14.65H8.031v-2.629h2.474v-1.749 c0-2.896,1.411-4.167,3.818-4.167c1.153,0,1.762,0.085,2.051,0.124v2.294h-1.642c-1.022,0-1.379,0.969-1.379,2.061v1.437h2.995 l-0.406,2.629h-2.588v7.247C18.235,21.236,22,17.062,22,12C22,6.477,17.523,2,12,2z"
            fill="currentColor"></path>


  </svg>
                    </span>
                </a>
                <a href="https://www.instagram.com/apiterapiiamivira/" title="Апітерапія в інстаграм">
                <span className="share-icon">
                    <svg width="100%" viewBox="0 0 24 24">

        <path
            d="M7.8,2H16.2C19.4,2 22,4.6 22,7.8V16.2A5.8,5.8 0 0,1 16.2,22H7.8C4.6,22 2,19.4 2,16.2V7.8A5.8,5.8 0 0,1 7.8,2M7.6,4A3.6,3.6 0 0,0 4,7.6V16.4C4,18.39 5.61,20 7.6,20H16.4A3.6,3.6 0 0,0 20,16.4V7.6C20,5.61 18.39,4 16.4,4H7.6M17.25,5.5A1.25,1.25 0 0,1 18.5,6.75A1.25,1.25 0 0,1 17.25,8A1.25,1.25 0 0,1 16,6.75A1.25,1.25 0 0,1 17.25,5.5M12,7A5,5 0 0,1 17,12A5,5 0 0,1 12,17A5,5 0 0,1 7,12A5,5 0 0,1 12,7M12,9A3,3 0 0,0 9,12A3,3 0 0,0 12,15A3,3 0 0,0 15,12A3,3 0 0,0 12,9Z"
            fill="currentColor"></path>


  </svg>
                </span>
                </a>
            </p>
    </address>
    </footer>;
}