import React from 'react';
import styles from './news.module.css';
import { getImagePath } from '../../utilities';
import { Dialog } from '@mui/material';

export default function ForCurious({
  isVisible,
  onCloseClick,
}: {
  isVisible: boolean;
  onCloseClick: () => void;
}) {
  return (
    <Dialog open={isVisible} onClose={() => onCloseClick()}>
      <div>
        <div className={styles.forCuriousCloseContainer}>
          <a
            href=""
            className={styles.forCuriousClose}
            onClick={(e) => {
              e.preventDefault();
              onCloseClick();
            }}
          >
            X
          </a>
        </div>
        <h1 className={styles.h1}>Трошки історії</h1>
        <img
          src={getImagePath('news8.jpg')}
          alt=""
          style={{ maxWidth: 244, maxHeight: 455 }}
          className={styles.float}
        />
        <p>
          Ранні відомості про лікувальні властивості меду належать до часів
          стародавнього світу (3500 р тому). Серед численних порад Гіппократа є
          й такі, де сказано про користь меду як лікарського засобу при різних
          захворюваннях. А від Авіценни людству дісталися рекомендації вживати
          мед, який збільшує тривалість життя. У сучасний період мед визнаний не
          тільки цінним харчовим продуктом, а й ефективним засобом в народній та
          науковій медицині. Він належить до рідкісних продуктів з багатим
          комплексом різноманітних речовин і мінеральних елементів. Штучно
          виготовити його не вдалось жодній лабораторії в світі.Весь перелік
          речовин і мінеральних елементів, що містяться в меді, становить
          близько 300 назв. Отже, їжте мед і будьте здорові. Апітерапія Мивіра
          вітає Вас з днем захисту дітей і запрошує на екскурсію! Вашим жінкам
          буде цікаво і смачно!!!
        </p>

        <h1 className={styles.h1}>Варто задуматись</h1>
        <p>
          Сучасний ритм життя створює занадто багато стресу кожній людині. Нудна
          робота, громадський транспорт, погані дороги та багато іншого
          перевіряє нашу нервову систему на міцність. Рано чи пізно ліміт
          закінчується. Ми зриваємося через дрібниці на рідних та на
          дітей...Відчути умиротворення насправді досить складно. Тільки поруч з
          природою можна по справжньому відпочити і фізично, і душевно.
          Рівномірний ґул бджіл і приємне тепло, яке створюють бджоли в
          апібудиночках, заспокоюють, відганяють негативні думки, залишаючи
          наодинці з собою. Оздоровчий апітерапевтичний комплекс Мивіра запрошує
          Вас знайти внутрішній спокій разом з нами.
        </p>

        <h1 className={`${styles.clearFloat} ${styles.h1}`}>
          Як все починалось
        </h1>
        <div className={styles.textIndent}>
          Перші вулики лежанки в нас появились ще у 2012 році, і тоді я
          насправді захопився апітерапією. Бджоли надають таку сильну енергію,
          спостерігаючи за ними розумієш що рух це життя. Сон у вулику не має
          проти показань, кожен бажаючий може полежати і відчути тепло бджолиної
          сім&apos;ї. Але треба знати певні застереження перед курсом апітерапії:
          <ol>
            <li>
              Бджоли реагують на сильні запахи, тому бажано утриматись від
              використання парфумів, кремів з різким ароматом, вживання
              алкоголю.
            </li>
            <li>
              Намагайтеся не одягати яскравий одяг, довге волосся заплести.
            </li>
            <li>
              Різкі рухи бджоли сприймають як загрозу. Тому галасувати, махати
              руками швидко бігати також не рекомендуємо.
            </li>
          </ol>
          <span>
            Ось і все. Сподіваюсь інформація була для Вас корисною і цікавою.
            Заходите в гості!
          </span>
        </div>

        <h1 className={styles.h1}>Знову екскурсія</h1>
        <p>
          <a
            className={styles.forCuriousLink}
            href="https://www.facebook.com/photo.php?fbid=108421490035155&set=pcb.108434336700537&type=3&theater"
          >
            Сьогодні &nbsp;
          </a>
          на екскурсію до нас завітали школярі з с Чудей. Діти дізналися як
          живуть і що їдять бджілки, побачили на власні очі куди збирається мед
          і, традиційно чай з печивом. Розширюйте кругозір разом з
          нами..приїжджайте в гості. Чекаємо!
        </p>
        <h1 className={styles.h1}>Екскурсія</h1>
        <p>
          Сьогодні в апітерапевтичний комплекс Мивіра на екскурсію завітали діти
          з чернівецької гімназії. Школярі мали змогу подивитися як працюють
          бджоли, побувати у апібудиночках та скуштувати трав&apos;яний чай з медом.
          Діти з захопленням міряли шапки пасічника і активно смакували домашнім
          печивом. Заходьте і Ви до нас!
        </p>
        <h1 className={styles.h1}>Наші перші гості</h1>
        <p>
          Наші перші гості вже{' '}
          <a
            className={styles.forCuriousLink}
            href="https://www.facebook.com/permalink.php?story_fbid=1768690636548047&id=1768319413251836"
          >
            отримали
          </a>{' '}
          свою порцію медового настрою і скуштували запашного травяного чаю з
          домашнім печивом. Не зволікайте і Ви!
        </p>
      </div>
    </Dialog>
  );
}
